docs/protobuf/style.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-14 Mon 07:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Protocol Buffer 样式指南</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Protocol Buffer 样式指南</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org34bc134">1. 标准文件格式</a></li>
<li><a href="#org82be5be">2. 文档结构</a></li>
<li><a href="#org6117468">3. Pcakge</a></li>
<li><a href="#orgaac6632">4. Message and field names</a></li>
<li><a href="#org5d7d781">5. Repeated fields</a></li>
<li><a href="#org5f6e1eb">6. Enums</a></li>
<li><a href="#org04ae686">7. Services</a></li>
<li><a href="#org84f3e0e">8. 避免的事</a></li>
</ul>
</div>
</div>
<p>
本文提供了 <code>.proto</code> 文件的样式指南。遵循这些约定，将使 Protocol Buffer 消息定义及其相应的类保持一致并易于阅读。请注意，Protocol Buffer 样式随着时间而发展，因此可能会看到以不同的约定或样式编写的 <code>.proto</code> 文件。修改这些文件时，请尊重现有样式。一致性是关键。但是，在创建新的 <code>.proto</code> 文件时，最好采用当前的最佳样式。
</p>

<div id="outline-container-org34bc134" class="outline-2">
<h2 id="org34bc134"><span class="section-number-2">1</span> 标准文件格式</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>保持行长为 80 个字符。</li>
<li>缩进 2 个空格。</li>
<li>最好对字符串使用双引号。</li>
</ul>
</div>
</div>

<div id="outline-container-org82be5be" class="outline-2">
<h2 id="org82be5be"><span class="section-number-2">2</span> 文档结构</h2>
<div class="outline-text-2" id="text-2">
<p>
文件应命名为 <code>lower_snake_case.proto</code>
</p>

<p>
所有文件应按以下方式排序：
</p>
<ol class="org-ol">
<li>License header (if applicable)</li>
<li>File overview</li>
<li>Syntax</li>
<li>Package</li>
<li>Imports (sorted)</li>
<li>File options</li>
<li>Everything else</li>
</ol>
</div>
</div>

<div id="outline-container-org6117468" class="outline-2">
<h2 id="org6117468"><span class="section-number-2">3</span> Pcakge</h2>
<div class="outline-text-2" id="text-3">
<p>
软件包名称应为小写，并且应与目录层次结构相对应。例如，如果文件位于 <code>my/package/</code> 中，则包名称应为 <code>my.package</code> 。
</p>
</div>
</div>

<div id="outline-container-orgaac6632" class="outline-2">
<h2 id="orgaac6632"><span class="section-number-2">4</span> Message and field names</h2>
<div class="outline-text-2" id="text-4">
<p>
使用 驼峰命名法（CamelCase）（首字母大写）作为消息名称，例如，SongServerRequest。使用 <code>underscore_separated_names</code> 作为字段名（包括 oneof 字段名和扩展），例如 song_name。
</p>

<div class="org-src-container">
<pre class="src src-protobuf"><span style="color: #00ffff; font-weight: bold;">message</span> <span style="color: #00ff00;">SongServerRequest</span> {
  <span style="color: #00ffff; font-weight: bold;">required</span> <span style="color: #00ff00;">string</span> <span style="color: #ffff00;">song_name</span> = 1;
}
</pre>
</div>

<p>
使用字段名称的这种命名约定，可以提供如下访问器：
</p>
<div class="org-src-container">
<pre class="src src-protobuf">C++:
  const <span style="color: #00ff00;">string</span>&amp; song_name() { ... }
  <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">set_song_name</span>(const <span style="color: #00ff00;">string</span>&amp; x) { ... }

Java:
  public String getSongName() { ... }
  public <span style="color: #00ff00;">Builder</span> <span style="color: #0000ff; font-weight: bold;">setSongName</span>(String v) { ... }
</pre>
</div>

<p>
如果字段名称包含数字，则该数字应出现在字母之后而不是下划线之后。例如，使用 <code>song_name1</code> 代替 <code>song_name_1</code>
</p>
</div>
</div>

<div id="outline-container-org5d7d781" class="outline-2">
<h2 id="org5d7d781"><span class="section-number-2">5</span> Repeated fields</h2>
<div class="outline-text-2" id="text-5">
<p>
对重复的字段使用复数名称。
</p>
<div class="org-src-container">
<pre class="src src-protobuf"><span style="color: #00ffff; font-weight: bold;">repeated</span> <span style="color: #00ff00;">string</span> <span style="color: #ffff00;">keys</span> = 1;
...
<span style="color: #00ffff; font-weight: bold;">repeated</span> MyMessage accounts = 17;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f6e1eb" class="outline-2">
<h2 id="org5f6e1eb"><span class="section-number-2">6</span> Enums</h2>
<div class="outline-text-2" id="text-6">
<p>
使用驼峰命名法（CamelCase）（以大写字母开头）作为枚举类型名称，并使用 CAPITALS_WITH_UNDERSCORES 作为值名称：
</p>
<div class="org-src-container">
<pre class="src src-protobuf"><span style="color: #00ffff; font-weight: bold;">enum</span> <span style="color: #00ff00;">Foo</span> {
  FOO_UNSPECIFIED = 0;
  FOO_FIRST_VALUE = 1;
  FOO_SECOND_VALUE = 2;
}
</pre>
</div>

<ul class="org-ul">
<li>每个枚举值都应以分号（而不是逗号）结尾。</li>
<li>优先为枚举值添加前缀，而不是将其包含在封闭消息中。</li>
<li>零值枚举应带有后缀 <code>UNSPECIFIED</code> 。</li>
</ul>
</div>
</div>

<div id="outline-container-org04ae686" class="outline-2">
<h2 id="org04ae686"><span class="section-number-2">7</span> Services</h2>
<div class="outline-text-2" id="text-7">
<p>
如果 <code>.proto</code> 定义了 RPC 服务，则应该对服务名称和任何 RPC 方法名称都使用驼峰命名法（CamelCase）（以大写字母开头）：
</p>
<div class="org-src-container">
<pre class="src src-protobuf"><span style="color: #00ffff; font-weight: bold;">service</span> <span style="color: #00ff00;">FooService</span> {
  <span style="color: #00ffff; font-weight: bold;">rpc</span> <span style="color: #0000ff; font-weight: bold;">GetSomething</span>(FooRequest) <span style="color: #00ffff; font-weight: bold;">returns</span> (FooResponse);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org84f3e0e" class="outline-2">
<h2 id="org84f3e0e"><span class="section-number-2">8</span> 避免的事</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Required fields (only for proto2)</li>
<li>Groups (only for proto2)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-09-14 Mon 07:31</p>
<p class="validation"></p>
</div>
</body>
</html>
